using System;

namespace Lab_2_3
{
    class Program
    {
        static void Main()
        {
            //  15 (завдання підвищеної складності)
            //  Напишіть програму, яка виведе всі цілі числа в діапазоні від 0(включно) до 999(включно) сума цифр яких дорівнює 15 у порядку зростання(69 78 87 96 159...)
            //  (наприклад, 717 має бути виведене, адже 7 + 1 + 7 = 15, 556 - ні, бо 5 + 5 + 6 = 16).
            //  Кожне число виведіть в новому рядку.

            for (int i0 = 0; i0 < 999; i0++)
            {

                int i1 = i0 / 100;
                int i2 = i0 / 10 - i1 * 10;
                int i3 = i0 - i1 * 100 - i2 * 10;

                if ((i1 + i2 + i3) == 15)
                {
                    if (i1 != 0)
                    {
                        Console.Write(i1);
                    }
                    Console.Write(i2);
                    Console.WriteLine(i3);
                }
            }

            Console.ReadLine();
        }
    }
}
